cfg/Documents/ИсполнительныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ИсполнительныйЛист</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УдалитьНамеченныеСобытияПоПерсоналуОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ПлановыеУдержанияРаботниковОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсполнительногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыИсполнительногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаИЛ</Name>
					<Comment>1 - процентом, 2 - фиксированной суммой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифПочты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПочтовыеТарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПеречисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПеречисленияСуммПоИсполнительнымЛистам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУвеличиватьДоМинимума</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексацияАлиментов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоИндексации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дети</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/InformationRegisters/ПлановыеУдержанияРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеУдержанияРаботниковОрганизаций</Name>
			<Comment>(Регл) Начало действия удержания начало дня, окончание удержания - конец дня</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучетеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УдержанияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсполнительныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводСведенийОПлановыхУдержанияхРаботниковОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ВидыДействияСНачислением.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДействияСНачислением</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начать</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменить</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИзменять</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прекратить</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/СпособыПеречисленияСуммПоИсполнительнымЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыПеречисленияСуммПоИсполнительнымЛистам</Name>
			<Comment>(регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧерезКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовымПереводом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Documents/ИсполнительныйЛист/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсполнительныйЛист.Дата,
	               |	ИсполнительныйЛист.Организация,
	               |	ИсполнительныйЛист.Сотрудник,
	               |	ИсполнительныйЛист.ДатаДействия,
	               |	ИсполнительныйЛист.ДатаОкончания,
	               |	ИсполнительныйЛист.Размер,
	               |	ИсполнительныйЛист.Предел,	               
	               |	ИсполнительныйЛист.СпособРасчетаИЛ,
	               |	ИсполнительныйЛист.Получатель,
	               |	ИсполнительныйЛист.ВидИсполнительногоДокумента,
	               |	ИсполнительныйЛист.Ссылка
	               |ИЗ
	               |	Документ.ИсполнительныйЛист КАК ИсполнительныйЛист
	               |
	               |ГДЕ
	               |	ИсполнительныйЛист.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указана организация!';uk='Не зазначена організація!'"), Отказ);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указан работник!';uk='Не зазначений працівник!'"), Отказ);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаДействия) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указана дата действия удержания!';uk='Не вказана дата дії утримання!'"), Отказ);
	КонецЕсли;
	
	// Получатель
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Получатель) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указан получатель!';uk='Не вказаний отримувач!'"), Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента)

	// Движения регистра ПлановыеУдержанияРаботниковОрганизаций
	
	// Определим вид расчета
	Если ВыборкаПоШапкеДокумента.ВидИсполнительногоДокумента = "Исполнительный лист"
		И ВыборкаПоШапкеДокумента.СпособРасчетаИЛ = 1 Тогда
		// Процентом
		
		Если ВыборкаПоШапкеДокумента.Предел = 0 Тогда
			ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ИЛПроцентом;
		Иначе	
			ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ИЛПроцентомДоПредела;
		КонецЕсли; 
		
	ИначеЕсли ВыборкаПоШапкеДокумента.ВидИсполнительногоДокумента = "Исполнительный лист" Тогда
		// Фикс суммой	
		
		Если ВыборкаПоШапкеДокумента.Предел = 0 Тогда
			ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ИЛФиксированнойСуммой;
		Иначе	
			ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ИЛФиксированнойСуммойДоПредела;
		КонецЕсли; 
		
	ИначеЕсли ВыборкаПоШапкеДокумента.СпособРасчетаИЛ = 1 Тогда
		// Алименты Процентом
		
		Если ВыборкаПоШапкеДокумента.Предел = 0 Тогда
			ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.АлиментыПроцентом;
		Иначе	
			ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.АлиментыПроцентомДоПредела;
		КонецЕсли; 
		
	Иначе
		// АлиментыФикс суммой	
		
		Если ВыборкаПоШапкеДокумента.Предел = 0 Тогда
			ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.АлиментыФиксированнойСуммой;
		Иначе	
			ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.АлиментыФиксированнойСуммойДоПредела;
		КонецЕсли; 
		
	КонецЕсли;  
	
	Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
	// свойства
	Движение.Период             = ВыборкаПоШапкеДокумента.ДатаДействия;

	// измерения
	Движение.Организация        = ВыборкаПоШапкеДокумента.Организация;
	Движение.Сотрудник			= ВыборкаПоШапкеДокумента.Сотрудник;
	Движение.ВидРасчета         = ВидРасчета;
	
	Движение.ДокументОснование	= ВыборкаПоШапкеДокумента.Ссылка;

	// ресурсы
	Движение.Действие           = Перечисления.ВидыДействияСНачислением.Начать;
	Движение.Показатель1		= ВыборкаПоШапкеДокумента.Размер;
	
	// Если у документа указана дата окончания его действия, то закроем датой окончания это удержание
	Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда
		Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
		// свойства
		Движение.Период             = КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончания);

		// измерения
		Движение.Организация        = ВыборкаПоШапкеДокумента.Организация;
		Движение.Сотрудник			= ВыборкаПоШапкеДокумента.Сотрудник;
		Движение.ВидРасчета         = ВидРасчета;
		
		Движение.ДокументОснование	= ВыборкаПоШапкеДокумента.Ссылка;

		// ресурсы
		Движение.Действие           = Перечисления.ВидыДействияСНачислением.Прекратить;
		Движение.Показатель1		= 0;		
	КонецЕсли;
	
	Если (СпособПеречисления=Перечисления.СпособыПеречисленияСуммПоИсполнительнымЛистам.ПочтовымПереводом) И (ТарифПочты<>Неопределено) Тогда
		
		Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
		// свойства
		Движение.Период             = ВыборкаПоШапкеДокумента.ДатаДействия;
		
		// измерения
		Движение.Организация        = ВыборкаПоШапкеДокумента.Организация;
		Движение.Сотрудник          = ВыборкаПоШапкеДокумента.Сотрудник;
		Движение.ВидРасчета         = ПланыВидовРасчета.УдержанияОрганизаций.ПочтовыйСбор;
		
		Движение.ДокументОснование	= ВыборкаПоШапкеДокумента.Ссылка;
		
		// ресурсы
		Движение.Действие           = Перечисления.ВидыДействияСНачислением.Начать;
		Движение.Показатель1				= 0;
		
		// Если у документа указана дата окончания его действия, то закроем и "почтовые тарифы"
		Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда
			Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
			// свойства
			Движение.Период             = КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончания);
			
			// измерения
			Движение.Организация        = ВыборкаПоШапкеДокумента.Организация;
			Движение.Сотрудник          = ВыборкаПоШапкеДокумента.Сотрудник;
			Движение.ВидРасчета         = ПланыВидовРасчета.УдержанияОрганизаций.ПочтовыйСбор;
			
			Движение.ДокументОснование	= ВыборкаПоШапкеДокумента.Ссылка;
			
			// ресурсы
			Движение.Действие           = Перечисления.ВидыДействияСНачислением.Прекратить;
			Движение.Показатель1				= 0;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИндексацияАлиментов Тогда
		
		Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
		// свойства
		Движение.Период             = ВыборкаПоШапкеДокумента.ДатаДействия;
		
		// измерения
		Движение.Организация        = ВыборкаПоШапкеДокумента.Организация;
		Движение.Сотрудник          = ВыборкаПоШапкеДокумента.Сотрудник;
		Движение.ВидРасчета         = ПланыВидовРасчета.УдержанияОрганизаций.ИндексацияАлиментов;
		
		Движение.ДокументОснование	= ВыборкаПоШапкеДокумента.Ссылка;
		
		// ресурсы
		Движение.Действие           = Перечисления.ВидыДействияСНачислением.Начать;
		Движение.Показатель1				= 0;
		
		// Если у документа указана дата окончания его действия, то закроем и "почтовые тарифы"
		Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда
			Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
			// свойства
			Движение.Период             = КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончания);
			
			// измерения
			Движение.Организация        = ВыборкаПоШапкеДокумента.Организация;
			Движение.Сотрудник          = ВыборкаПоШапкеДокумента.Сотрудник;
			Движение.ВидРасчета         = ПланыВидовРасчета.УдержанияОрганизаций.ИндексацияАлиментов;
			
			Движение.ДокументОснование	= ВыборкаПоШапкеДокумента.Ссылка;
			
			// ресурсы
			Движение.Действие           = Перечисления.ВидыДействияСНачислением.Прекратить;
			Движение.Показатель1				= 0;	
		КонецЕсли;
		
	КонецЕсли;

	
		
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда

			Если НЕ Отказ Тогда
				// Заполним записи в наборах записей регистров
				ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента);
			КонецЕсли;
			
		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицо(ЭтотОбъект);
	
КонецПроцедуры
